{
  "source": "stackoverflow",
  "feed": "https://stackoverflow.com/feeds/tag?tagnames=ssl&sort=newest",
  "domain": "stackoverflow.com",
  "title": "Server api endpoint SSL requirements for IOS 18 requests",
  "url": "https://stackoverflow.com/questions/79751486/server-api-endpoint-ssl-requirements-for-ios-18-requests",
  "created": "2025-09-21 23:55:50+00:00",
  "text": "<p>I am trying to make a Get Request to a server endpoint. The endpoint is on a shared host that I control except that I have minimal control over the SSL.</p>\n<p>Recently--I think since IOS 18, after an asynchronous request, the app is hanging for 20 seconds or so before returning results and in the console I see up to 10 or more messages as follows:</p>\n<pre><code>tcp_input [C6.1.1:3] flags=[R] seq=19931096, ack=0, win=0 state=CLOSED rcv_nxt=19931096, snd_una=42308392\n</code></pre>\n<p>Apparently [R] means reset. The code making the request looks like this:</p>\n<pre><code>NSLog(@&quot;starting call NOW to url: %@&quot;,dataUrl);\nNSURLSessionDataTask *data = [session dataTaskWithURL:dataUrl completionHandler:^(NSData *data, NSURLResponse *response, NSError *error) {\nNSLog(@&quot;heard back from server&quot;);//This takes 20 seconds even when the data is just a few bytes\n</code></pre>\n<p>According to <a href=\"https://developer.apple.com/forums/thread/123702\" rel=\"nofollow noreferrer\">some posts</a>, the tcp_input warnings are most likely a low level operating system warning that the TCP connection has been reset by the server. The consensus seems to be that this is most often due to a bad handshake over SSL.</p>\n<p>My webhost suggested I upgrade from a free Let's Encrypt certificate to a Domain Validated one from Comodo. Apparently the free one does not reference the domain.</p>\n<p>Before I try this, however, if the issue is with Apple rejecting the SSL cert as of IOS 18 and then the server closing the request, then why does the server eventually return results after 20 seconds or so?  Why the long delay but afterwards success? Every now and then it returns quickly but this is the exception.</p>\n<p>I have tried this on various networks and I have also tested with an endpoint that just says &quot;Hello World&quot; but get the same delay.</p>\n<p>I see this delay in FlexTool as well. I should mention that when I load the page from a web browser, it loads instantly with ",
  "id": "b22c93b96fc5228e4dcf366bdae0050cc98bdd69"
}